org/linux/xps-mic.org
#+TITLE: Fix Dell XPS 9700 microphone
#+AUTHOR: Bryan Rinders
#+DATE: <2023-09-10 Sun>
#+OPTIONS: num:nil
#+PROPERTY: header-args :results output :exports both :eval never-export
#+PROPERTY: header-args:python :session *natas-python-session*

* Fix Microphone On XPS 9700
{{{date([%Y-%m-%d])}}} I fixed the Issue by switching the rt715 ADC 24
Mux selector in ~alsamixer~ to DMIC3.

Save settings with ~sudo alsactl store~. After storing the settings
you have to restore them on every boot up usinng ~alsactl restore~. To
safe the settings to a specific file, useful for placing it under
version control, you can specify the ~-f~ flag in both ~alsactl~
command followed by a file path i.e.

#+begin_src sh
  alsactl store -f ~/.config/alsa/asound.state
  alsactl restore -f ~/.config/alsa/asound.state
#+end_src

* Noise Cancelation
The commands below will create a new device which you can select with
for example ~pavucontrol~.

#+begin_src sh
  sudo cp /etc/pulse/default.pa /etc/pulse/default.pa.bak
  sudo cat <<EOT >> /etc/pulse/default.pa
       load-module module-echo-cancel source_name=noechosource
       sink name=noechosink
       set-default-source noechosource
       set-default-sink noechosink
#+end_src

* Sources
- [[https://askubuntu.com/a/1362014]]
- [[https://www.youtube.com/watch?v=lTodCeVAfpI]]
