linux/xps-mic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fix Dell XPS 9700 microphone</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/css/default.css' />
<link rel='stylesheet' href='/css/source-code.css' />
</head>
<body>
<div id="preamble" class="status">
<h1 id='site-name'>Bryan Rinders</h1>
<div id='menu'>
  <a href='/'>Home</a>
  <a href='/ctf-index.html'>CTF WriteUps</a>
  <a href='/emacs-index.html'>Emacs</a>
  <a href='/linux-index.html'>Linux Tutorials</a>
  <a href='https://gitlab.com/bryos/dotfiles' target='_blank'>Dotfiles</a>
</div>
<br><hr>
</div>
<div id="content">
<h1 class="title">Fix Dell XPS 9700 microphone</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Fix-Microphone-On-XPS-9700">Fix Microphone On XPS 9700</a></li>
<li><a href="#Noise-Cancelation">Noise Cancelation</a></li>
<li><a href="#Sources">Sources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org21e8423" class="outline-2">
<h2 id="Fix-Microphone-On-XPS-9700"><a href="#Fix-Microphone-On-XPS-9700">Fix Microphone On XPS 9700</a></h2>
<div class="outline-text-2" id="text-Fix-Microphone-On-XPS-9700">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-09-10 Sun]</span></span>
</p>

<p>
I fixed the Issue by switching the rt715 ADC 24 Mux selector in
<code>alsamixer</code> to DMIC3.
</p>

<p>
Save settings with <code>sudo alsactl store</code>. After storing the settings
you have to restore them on every boot up usinng <code>alsactl restore</code>. To
safe the settings to a specific file, useful for placing it under
version control, you can specify the <code>-f</code> flag in both <code>alsactl</code>
command followed by a file path i.e.
</p>

<div class="org-src-container">
<pre class="src src-sh">alsactl store -f ~/.config/alsa/asound.state
alsactl restore -f ~/.config/alsa/asound.state
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc1ba8d" class="outline-2">
<h2 id="Noise-Cancelation"><a href="#Noise-Cancelation">Noise Cancelation</a></h2>
<div class="outline-text-2" id="text-Noise-Cancelation">
<p>
The commands below will create a new device which you can select with
for example <code>pavucontrol</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo cp /etc/pulse/default.pa /etc/pulse/default.pa.bak
sudo cat &lt;&lt;EOT &gt;&gt; /etc/pulse/default.pa
<span class="org-sh-heredoc">     load-module module-echo-cancel source_name=noechosource</span>
<span class="org-sh-heredoc">     sink name=noechosink</span>
<span class="org-sh-heredoc">     set-default-source noechosource</span>
<span class="org-sh-heredoc">     set-default-sink noechosink</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6484121" class="outline-2">
<h2 id="Sources"><a href="#Sources">Sources</a></h2>
<div class="outline-text-2" id="text-Sources">
<ul class="org-ul">
<li><a href="https://askubuntu.com/a/1362014">https://askubuntu.com/a/1362014</a></li>
<li><a href="https://www.youtube.com/watch?v=lTodCeVAfpI">https://www.youtube.com/watch?v=lTodCeVAfpI</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<div style='text-align: center;'>
  If something is not working, please create an issue
  <a href='https://gitlab.com/bryanrinders/bryanrinders.xyz/-/issues'>here</a>.
</div>
<br><hr/>
<footer>
  <div class='copyright-container'>
    <div class='copyright'>
      Copyright &copy; 2022-2024 Bryan Rinders some rights reserved
      <br><br>
      This page is available under a
      <a rel='license' href='http://creativecommons.org/licenses/by/4.0/'>
        CC-BY 4.0
      </a> licence.
    </div>
  </div>
  <br>
  <div class='generated'>
    Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3) on <a href='https://www.gnu.org'>GNU</a>+<a href='https://www.kernel.org/'>Linux</a>
  </div>
</footer>
</div>
</body>
</html>
